{
  "char2idx": {
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2,
    "<unk>": 3,
    " ": 4,
    "a": 5,
    "b": 6,
    "c": 7,
    "d": 8,
    "e": 9,
    "f": 10,
    "g": 11,
    "h": 12,
    "i": 13,
    "j": 14,
    "k": 15,
    "l": 16,
    "m": 17,
    "n": 18,
    "o": 19,
    "p": 20,
    "q": 21,
    "r": 22,
    "s": 23,
    "t": 24,
    "u": 25,
    "v": 26,
    "w": 27,
    "x": 28,
    "y": 29,
    "z": 30,
    "0": 31,
    "1": 32,
    "2": 33,
    "3": 34,
    "4": 35,
    "5": 36,
    "6": 37,
    "7": 38,
    "8": 39,
    "9": 40,
    ".": 41,
    ",": 42,
    "!": 43,
    "?": 44,
    "'": 45,
    "-": 46,
    ":": 47,
    ";": 48,
    "\"": 49,
    "(": 50,
    ")": 51,
    "[": 52,
    "]": 53,
    "{": 54,
    "}": 55,
    "@": 56,
    "#": 57,
    "$": 58,
    "%": 59,
    "&": 60,
    "*": 61,
    "+": 62,
    "=": 63,
    "/": 64,
    "<": 65,
    ">": 66,
    "\\": 67,
    "|": 68,
    "~": 69,
    "`": 70,
    "^": 71,
    "_": 72
  },
  "idx2char": {
    "0": "<pad>",
    "1": "<sos>",
    "2": "<eos>",
    "3": "<unk>",
    "4": " ",
    "5": "a",
    "6": "b",
    "7": "c",
    "8": "d",
    "9": "e",
    "10": "f",
    "11": "g",
    "12": "h",
    "13": "i",
    "14": "j",
    "15": "k",
    "16": "l",
    "17": "m",
    "18": "n",
    "19": "o",
    "20": "p",
    "21": "q",
    "22": "r",
    "23": "s",
    "24": "t",
    "25": "u",
    "26": "v",
    "27": "w",
    "28": "x",
    "29": "y",
    "30": "z",
    "31": "0",
    "32": "1",
    "33": "2",
    "34": "3",
    "35": "4",
    "36": "5",
    "37": "6",
    "38": "7",
    "39": "8",
    "40": "9",
    "41": ".",
    "42": ",",
    "43": "!",
    "44": "?",
    "45": "'",
    "46": "-",
    "47": ":",
    "48": ";",
    "49": "\"",
    "50": "(",
    "51": ")",
    "52": "[",
    "53": "]",
    "54": "{",
    "55": "}",
    "56": "@",
    "57": "#",
    "58": "$",
    "59": "%",
    "60": "&",
    "61": "*",
    "62": "+",
    "63": "=",
    "64": "/",
    "65": "<",
    "66": ">",
    "67": "\\",
    "68": "|",
    "69": "~",
    "70": "`",
    "71": "^",
    "72": "_"
  }
}